import pandas as pd
import numpy as np

df = pd.read_csv("D:\\ksc\\data_转换率—患者满意度.csv")
df['城市等级'] = '其他'
cshf ={
    '一线城市' :['北京', '上海', '广州', '深圳'],
    '二线城市' :['昆明', '福州', '无锡', '厦门', '哈尔滨', '长春', '南昌', '济南', '宁波', '大连', '贵阳', '温州', '石家庄', '泉州', '南宁', '金华', '常州', '珠海', '惠州', '嘉兴', '南通', '中山', '保定', '兰州', '台州', '徐州', '太原', '绍兴', '烟台', '海口', '乌鲁木齐', '呼和浩特'],
    '新一线城市' :['成都', '重庆', '杭州', '武汉', '西安', '郑州', '青岛', '长沙', '天津', '苏州', '南京', '东莞', '沈阳', '合肥', '佛山'],

}

for key,value in cshf.items():
    df.loc[df['医生所在城市'].isin(value),['城市等级']] = key
df.loc[df['城市等级'] =='新一线城市',['城市等级']] = '二线城市'
df['欢迎词字数'] = df['医生欢迎词'].str.len()
df = df.fillna(0)
df['字数平方'] = df['欢迎词字数']*df['欢迎词字数']

df1 = df.loc[df['城市等级'] =='一线城市']
df2 = df.loc[df['城市等级'] =='二线城市']
df3 = df.loc[df['城市等级'] =='其他']
df1.to_csv("D:\\ksc\\一线城市.csv")
df2.to_csv("D:\\ksc\\二线城市.csv")
df3.to_csv("D:\\ksc\\其他.csv")
df.to_csv("D:\\ksc\\总.csv")
a=1